---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
source: html/a592db9a-6700-251e-c4c6-2bbadb1b46c0.htm
---
# TemperatureRatingTypeSetIterator Properties

Retrieves the item that is the current focus of the iterator.